Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упЗональныеНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗональныеНастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДоГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПослеГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упДоступныеГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДоступныеГеографическиеЗоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПравилаДоступности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРасстоянияМеждуЗонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасстоянияМеждуЗонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НачальнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упПравилаДоступностиГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаДоступностиГеографическихЗон</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапрещенаРаботаВУказанныхЗонах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГеографическиеЗоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГеографическаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упГеографическиеЗоны/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЕстьПравоРедактировать = Справочники.упАдреса.ВыполнитьПроверкуПраваПодтверждениеКорректностиГеографическихДанных();
	
	Если НЕ ЕстьПравоРедактировать И Подтверждена Тогда
		ТекстОшибки = СтрШаблон("У вас нет права корректировать зону: %1. Установлен признак подтверждения!!!",Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
	КонецЕсли;
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ПолигонПростойАктуален") Тогда
		ЭтотОбъект.ПолигонПростой.Очистить();
	КонецЕсли; 
	Если Полигон.Количество() Тогда 
		Для Каждого текТочка Из Полигон Цикл 
			Пока текТочка.Широта > 180 Цикл 
				текТочка.Широта = текТочка.Широта - 180;
			КонецЦикла;
			Пока текТочка.Широта < -180 Цикл 
				текТочка.Широта = текТочка.Широта + 180;
			КонецЦикла;
			Пока текТочка.Долгота > 360 Цикл 
				текТочка.Долгота = текТочка.Долгота - 360;
			КонецЦикла;
			Пока текТочка.Долгота < -360 Цикл 
				текТочка.Долгота = текТочка.Долгота + 360;
			КонецЦикла;
		КонецЦикла;	
			
		МинШирота   = 180;
		МаксШирота  = -180;
		МинДолгота  = 180;
		МаксДолгота = -180;
		Для Каждого текТочка Из Полигон Цикл 
			МинШирота  = Мин(МинШирота, текТочка.Широта);
			МаксШирота = Макс(МаксШирота, текТочка.Широта);
			
			Если Не ПроходитЧерез180Меридиан Тогда 
				МинДолгота  = Мин(МинДолгота, текТочка.Долгота);
				МаксДолгота = Макс(МаксДолгота, текТочка.Долгота);
			ИначеЕсли текТочка.Долгота < 0 Тогда
				МаксДолгота = Макс(МаксДолгота, текТочка.Долгота);
			Иначе
				МинДолгота  = Мин(МинДолгота, текТочка.Долгота);
			КонецЕсли;	
		КонецЦикла;	
		//Если упСервисныеФункции.ПолучитьЗначениеКонстанты(Метаданные.Константы.упРассчитыватьПростыеПолилинии.Имя) Тогда
		//	ПолигонПростой.Загрузить(Полигон.Выгрузить(упРаботаСКартами.ВыполнитьУпрощениеПолигональнойЦепи(Полигон,, 200)));
		//КонецЕсли;
	Иначе	
		МинШирота   = 0;
		МаксШирота  = 0;
		МинДолгота  = 0;
		МаксДолгота = 0;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьИерархиюЗон();
	
	Если ПолучитьФункциональнуюОпцию("упКонтролироватьДоступностьГеографическихЗон") Тогда 
		ЗаписатьПравилаДоступности();
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ЗональныеНастройкиМаршрутизации") Тогда
		ДополнительныеСвойства.ЗональныеНастройкиМаршрутизации.ЗаполнитьЗначения(Ссылка, "ЗонаОтправления");
		Набор = РегистрыСведений.упЗональныеНастройкиМаршрутизации.СоздатьНаборЗаписей();
		Набор.Отбор.ЗонаОтправления.Установить(Ссылка);
		Набор.Загрузить(ДополнительныеСвойства.ЗональныеНастройкиМаршрутизации);
		Набор.Записать();
	КонецЕсли; 

КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(Родитель) И Родитель = Ссылка Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Родителем географической зоны не может быть она же.'"), Ссылка, "Объект.Родитель",, Отказ);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	НаборЗаписей = РегистрыСведений.упДоступныеГеографическиеЗоны.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГеографическаяЗона.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);

	НаборЗаписей = РегистрыСведений.упРасстоянияМеждуЗонами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НачальнаяЗона.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);

	НаборЗаписей = РегистрыСведений.упРасстоянияМеждуЗонами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонечнаяЗона.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда 
			сткДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Родитель, "Регион, Страна");
			Если Не ДанныеЗаполнения.Свойство("Страна") Тогда 
				ДанныеЗаполнения.Вставить("Страна", сткДанныеРодителя.Страна);
			КонецЕсли;	
			Если Не ДанныеЗаполнения.Свойство("Регион") Тогда 
				ДанныеЗаполнения.Вставить("Регион", сткДанныеРодителя.Регион);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИерархияЗон

// Процедура записывает информацию об иерархии зон
// 
Процедура ЗаписатьИерархиюЗон()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упГеографическиеЗоны.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	|ГДЕ
	|	упГеографическиеЗоны.Ссылка В ИЕРАРХИИ(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДеревоИерархии = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ТекущийЭлемент = ДеревоИерархии.Строки.Найти(Ссылка,"Ссылка",Истина);
	
	Если ТекущийЭлемент <> Неопределено Тогда
		ВыполнитьЗаписьВИерархию(ТекущийЭлемент);
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура записывает информацию об иерархии подчиненных зон
// 
Процедура ВыполнитьЗаписьПоПодчиненным(СтрокиДерева, ТекущийЭлемент)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Ссылка <> ТекущийЭлемент Тогда
			ВыполнитьЗаписьВИерархию(СтрокаДерева);
		КонецЕсли;
	КонецЦикла; 	
	
КонецПроцедуры

// Процедура записывает в регистр информацию об иерархии зон
// 
Процедура ВыполнитьЗаписьВИерархию(СтрокаДерева);
	
	НаборЗаписей = РегистрыСведений.упИерархияГеографическихЗон.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Зона.Установить(СтрокаДерева.Ссылка);
	
	РодительСтроки = СтрокаДерева;
	Пока РодительСтроки <> Неопределено Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Зона     = СтрокаДерева.Ссылка;
		ЗаписьНабора.Родитель = РодительСтроки.Ссылка;
		ЗаписьНабора.Уровень  = РодительСтроки.Уровень();
		
		РодительСтроки = РодительСтроки.Родитель;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	ВыполнитьЗаписьПоПодчиненным(СтрокаДерева.Строки, СтрокаДерева.Ссылка);
	
КонецПроцедуры

#КонецОбласти 

#Область ПравилаДоступности

// Процедура записывает информацию о правилах доступности
// 
// Параметры:
//  Нет.
//
Процедура ЗаписатьПравилаДоступности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упИерархияГеографическихЗон.Зона КАК Зона,
	|	упПравилаДоступностиГеографическихЗон.Ссылка КАК Правила,
	|	упПравилаДоступностиГеографическихЗон.ЗапрещенаРаботаВУказанныхЗонах
	|ПОМЕСТИТЬ втЗоныДляПерезаписи
	|ИЗ
	|	РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон,
	|	Справочник.упПравилаДоступностиГеографическихЗон КАК упПравилаДоступностиГеографическихЗон
	|ГДЕ
	|	упИерархияГеографическихЗон.Родитель = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правила,
	|	Зона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПравилаДоступностиГеографическихЗонГеографическиеЗоны.Ссылка КАК Правила,
	|	упИерархияГеографическихЗон.Зона КАК Зона
	|ПОМЕСТИТЬ втЗоныПравил
	|ИЗ
	|	Справочник.упПравилаДоступностиГеографическихЗон.ГеографическиеЗоны КАК упПравилаДоступностиГеографическихЗонГеографическиеЗоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон
	|		ПО упПравилаДоступностиГеографическихЗонГеографическиеЗоны.ГеографическаяЗона = упИерархияГеографическихЗон.Родитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правила,
	|	Зона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗоныДляПерезаписи.Правила,
	|	втЗоныДляПерезаписи.Зона КАК Зона
	|ИЗ
	|	втЗоныДляПерезаписи КАК втЗоныДляПерезаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗоныПравил КАК втЗоныПравил
	|		ПО втЗоныДляПерезаписи.Зона = втЗоныПравил.Зона
	|			И втЗоныДляПерезаписи.Правила = втЗоныПравил.Правила
	|ГДЕ
	|	(втЗоныДляПерезаписи.ЗапрещенаРаботаВУказанныхЗонах
	|				И втЗоныПравил.Зона ЕСТЬ NULL 
	|			ИЛИ НЕ втЗоныДляПерезаписи.ЗапрещенаРаботаВУказанныхЗонах
	|				И НЕ втЗоныПравил.Зона ЕСТЬ NULL )
	|ИТОГИ ПО
	|	Зона";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаЗоны = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗоны.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.упДоступныеГеографическиеЗоны.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГеографическаяЗона.Установить(ВыборкаЗоны.Зона);
		
		Выборка = ВыборкаЗоны.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Запись = НаборЗаписей.Добавить();
			Запись.ПравилаДоступности = Выборка.Правила;
			Запись.ГеографическаяЗона = Выборка.Зона;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
	
КонецПроцедуры // ЗаписатьПравилаДоступности()

#КонецОбласти 

#КонецОбласти

#КонецЕсли
